create table sys_hall
(
    hall_id       bigint unsigned auto_increment comment '影厅编号'
        primary key,
    cinema_id     bigint unsigned   default 1   not null comment '影院编号',
    hall_name     varchar(255)                  not null comment '影厅名称',
    hall_category varchar(255)                  not null comment '影厅类别',
    row_start     varchar(10)       default '1' null comment '排开始编号，如1排/A排，默认1排',
    row_nums      smallint unsigned default 10  not null comment '总排数，默认10',
    seat_nums_row smallint unsigned default 18  not null comment '每排的座位数，默认18',
    seat_nums     smallint unsigned default 180 not null comment '总可用座位数，用于判断影厅是否做满，默认180',
    seat_state    varchar(1600)                 not null comment '所有座位的状态，0表示可用，1表示禁用，2表示售出，在场次表中体现',
    del_state     tinyint           default 0   not null comment '删除标记，0未删除，1删除，默认0',
    hall_equip    varchar(500)                  null
)
    charset = utf8;

INSERT INTO cinema_manager.sys_hall (hall_id, cinema_id, hall_name, hall_category, row_start, row_nums, seat_nums_row, seat_nums, seat_state, del_state, hall_equip) VALUES (1, 1, '激光1号厅', 'N号激光厅', '1', 10, 10, 100, '{"1":[0,0,0,0,0,0,0,0,0,0],"2":[0,0,0,0,0,0,0,0,0,0],"3":[0,0,0,0,0,0,0,0,0,0],"4":[0,0,0,0,0,0,0,0,0,0],"5":[0,0,0,0,0,0,0,0,0,0],"6":[0,0,0,0,0,0,0,0,0,0],"7":[0,0,0,0,0,0,0,0,0,0],"8":[0,0,0,0,0,0,0,0,0,0],"9":[0,0,0,0,0,0,0,0,0,0],"10":[0,0,0,0,0,0,0,0,0,0]}', 0, '1、放映设备：激光放映机、3DTMS银幕及银幕架。
2、音响设备：杜比全景声12声道音箱系统。
3、运营设备：监控、自助存包柜、广播系统、消防系统等。');
INSERT INTO cinema_manager.sys_hall (hall_id, cinema_id, hall_name, hall_category, row_start, row_nums, seat_nums_row, seat_nums, seat_state, del_state, hall_equip) VALUES (2, 1, '激光2号厅', 'N号激光厅', '1', 10, 10, 100, '{"1":[0,0,0,0,0,0,0,0,0,0],"2":[0,0,0,0,0,0,0,0,0,0],"3":[0,0,0,0,0,0,0,0,0,0],"4":[0,0,0,0,0,0,0,0,0,0],"5":[0,0,0,0,0,0,0,0,0,0],"6":[0,0,0,0,0,0,0,0,0,0],"7":[0,0,0,0,0,0,0,0,0,0],"8":[0,0,0,0,0,0,0,0,0,0],"9":[0,0,0,0,0,0,0,0,0,0],"10":[0,0,0,0,0,0,0,0,0,0]}', 0, '1、放映设备：激光放映机、3DTMS银幕及银幕架。
2、音响设备：杜比全景声12声道音箱系统。
3、运营设备：监控、自助存包柜、广播系统、消防系统等。');
INSERT INTO cinema_manager.sys_hall (hall_id, cinema_id, hall_name, hall_category, row_start, row_nums, seat_nums_row, seat_nums, seat_state, del_state, hall_equip) VALUES (3, 1, '激光3号厅', 'N号激光厅', '1', 10, 10, 100, '{"1":[0,0,0,0,0,0,0,0,0,0],"2":[0,0,0,0,0,0,0,0,0,0],"3":[0,0,0,0,0,0,0,0,0,0],"4":[0,0,0,0,0,0,0,0,0,0],"5":[0,0,0,0,0,0,0,0,0,0],"6":[0,0,0,0,0,0,0,0,0,0],"7":[0,0,0,0,0,0,0,0,0,0],"8":[0,0,0,0,0,0,0,0,0,0],"9":[0,0,0,0,0,0,0,0,0,0],"10":[0,0,0,0,0,0,0,0,0,0]}', 0, '1、放映设备：激光放映机、3DTMS银幕及银幕架。
2、音响设备：杜比全景声12声道音箱系统。
3、运营设备：监控、自助存包柜、广播系统、消防系统等。');
INSERT INTO cinema_manager.sys_hall (hall_id, cinema_id, hall_name, hall_category, row_start, row_nums, seat_nums_row, seat_nums, seat_state, del_state, hall_equip) VALUES (4, 1, '巨幕1号厅', 'IMAX巨幕厅', '1', 20, 20, 400, '{"1":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"2":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"3":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"4":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"5":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"6":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"7":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"8":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"9":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"10":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"11":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"12":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"13":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"14":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"15":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"16":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"17":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"18":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"19":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"20":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}', 0, '1、放映设备：新一代IMAX激光放映机、IMAX巨幕及银幕架。
2、音响设备：60声道杜比全景声系统。
3、运营设备：监控、自助存包柜、广播系统、消防系统等。');
INSERT INTO cinema_manager.sys_hall (hall_id, cinema_id, hall_name, hall_category, row_start, row_nums, seat_nums_row, seat_nums, seat_state, del_state, hall_equip) VALUES (5, 1, '巨幕2号厅', 'IMAX巨幕厅', '1', 20, 20, 400, '{"1":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"2":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"3":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"4":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"5":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"6":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"7":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"8":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"9":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"10":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"11":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"12":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"13":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"14":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"15":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"16":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"17":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"18":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"19":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],"20":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}', 0, '1、放映设备：新一代IMAX激光放映机、IMAX巨幕及银幕架。
2、音响设备：60声道杜比全景声系统。
3、运营设备：监控、自助存包柜、广播系统、消防系统等。');
